app/views/end_users/orders/index.html.erb

            <td>
                <%= order_detail.order.address %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 10]]