app/views/end_users/orders/new.html.erb

        <%= f.label :address_id, '登録済み住所から選択' %><br>
        <%= f.select :address_id, current_end_user.addresses.map{|a| [a.address,a.id]},
        {prompt: "選択してください"} %> <br>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."end_user_id" = ?  [["end_user_id", 6]]