app/views/end_users/orders/show.html.erb

            <% sum = 0 %>
            <% @order.end_user.cart_items.each do |cart_item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 10]]