app/controllers/admins/end_users_controller.rb

    def index
        @end_users = EndUser.all
---
SELECT "end_users".* FROM "end_users"