app/controllers/admins/genre_controller.rb

SELECT "genres".* FROM "genres"
---
    def index
        @genre = Genre.new
        @genres = Genre.all

INSERT INTO "genres" ("name", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test4"], ["is_active", 0], ["created_at", "2020-08-03 05:52:49.184068"], ["updated_at", "2020-08-03 05:52:49.184068"]]
SELECT "genres".* FROM "genres"
---
    def create
        @genre = Genre.new(genre_params)
        if @genre.save
            redirect_to admins_genre_index_path
        else
            @genres = Genre.all

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "genres" SET "is_active" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["is_active", 1], ["updated_at", "2020-08-03 06:02:14.566323"], ["id", 5]]
---
    def update
        @genre = Genre.find(params[:id])
        if @genre.update(genre_params)