app/controllers/admins/items_controller.rb

INSERT INTO "items" ("genre_id", "name", "description", "image_id", "is_active", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@item = Item.new(item_params)
        if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "b8d50f6fa15b71598d2fa916972cd0558fc31796ebb9c40f2e4adcb151ba"], ["is_active", 0], ["updated_at", "2020-09-26 18:07:16.162042"], ["id", 13]]
---
	def update
		@item = Item.find(params[:id])
        if @item.update(item_params)