app/controllers/admins/order_details_controller.rb

    def index
        @order_details = OrderDetail.all
---
SELECT "order_details".* FROM "order_details"

    def update
        @order_detail = OrderDetail.find(params[:id])
        if @order_detail.update(order_detail_params)
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_details" SET "work_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["work_status", 2], ["updated_at", "2020-09-26 19:03:13.761088"], ["id", 1]]