app/views/admins/items/new.html.erb

SELECT "genres".* FROM "genres"
---
            <%#= f.collection_select <属性名>, <プルダウンメニュー表示用の配列データ>, <valueとして扱うカラム名>,  <表示用のカラム名>, <オプション> %>
            <%= f.collection_select :genre_id, Genre.all, :id, :name, class: "selectpicker" %> <br>