app/controllers/end_users/addresses_controller.rb

	def index
		@address = Address.new
		@addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

	def create
		address = Address.new(address_params)
		if address.save
---
INSERT INTO "addresses" ("end_user_id", "postal_code", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["end_user_id", 3], ["postal_code", "aa"], ["address", "aa"], ["name", "aa"], ["created_at", "2020-09-26 19:05:46.572045"], ["updated_at", "2020-09-26 19:05:46.572045"]]

	def update
		address = Address.find(params[:id])
		if address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["name", "aaaa"], ["updated_at", "2020-09-26 19:05:52.152512"], ["id", 1]]

	def destroy
		address = Address.find(params[:id])
		address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]