app/controllers/end_users/cart_items_controller.rb

    def index
        @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items"

    def create
        cart_item = CartItem.new(cart_item_params)
        duplication_cart_item = CartItem.where(end_user_id: cart_item.end_user_id,item_id: cart_item.item_id).first
        if duplication_cart_item.nil?
            if cart_item.save
                redirect_to end_users_cart_items_path #カートの一覧画面
            else
                render 'end_users/items/show'
            end
        else
            duplication_cart_item.amount += cart_item.amount
            if duplication_cart_item.save
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? AND "cart_items"."item_id" = ? ORDER BY "cart_items"."id" ASC LIMIT ?  [["end_user_id", 6], ["item_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2020-08-11 09:08:25.724320"], ["id", 10]]
INSERT INTO "cart_items" ("end_user_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["end_user_id", 6], ["item_id", 1], ["amount", 1], ["created_at", "2020-08-11 09:02:02.269113"], ["updated_at", "2020-08-11 09:02:02.269113"]]

    def destroy
        cart_item = CartItem.find(params[:id])
        cart_item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]

    def update
        # cart_item = CartItem.find(params[:id])
        cart_item = CartItem.find_by(end_user_id: params[:cart_item][:end_user_id],item_id: params[:cart_item][:item_id])
        # binding.pry
        if cart_item.update(cart_item_params)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" IS NULL AND "cart_items"."item_id" IS NULL ORDER BY "cart_items"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 10], ["updated_at", "2020-08-29 03:09:53.905041"], ["id", 13]]

    def destroy_all
        CartItem.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 7]]