app/controllers/end_users/genres_controller.rb

SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @genres = Genre.all
        @genre_items = Genre.find(params[:id]).items