app/controllers/end_users/items_controller.rb

SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items" WHERE (name LIKE '%1%')
SELECT "items".* FROM "items"
---
	def index
		@genres = Genre.all
		if params[:name].present?
			@items = Item.where(['name LIKE ?', "%#{params[:name]}%"])
		else
			@items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
	def show
		@item = Item.find(params[:id])
		@cart_item = CartItem.new
		@genres = Genre.all