app/controllers/end_users/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 10]]
---
	def index
		@orders = current_end_user.orders

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
INSERT INTO "orders" ("end_user_id", "postcode", "address", "delivery_name", "postage", "total_fee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def create
		orderer = EndUser.find(params[:order][:end_user_id])
		#ご自身の住所から登録	0
		#登録済み住所から登録	1
		#新規住所から登録　　	2
		case params[:order][:address_option].to_i
			when 0 then
				order = Order.new(
					end_user_id:	orderer.id,
					postcode:		orderer.postal_code,
					address:		orderer.address,
					delivery_name:	orderer.last_name + orderer.first_name,
					payment: 		params[:order][:payment]
				)
				order.total_fee = calc_TotalFee(orderer.cart_items)
				order.postage = 800
				if order.save
					redirect_to end_users_order_path(order) and return
				end
			when 1 then
				orderer_address = Address.find(params[:order][:address_id])
				order = Order.new(
					end_user_id: 	orderer.id,
					postcode: 	 	orderer_address.postal_code,
					address: 	 	orderer_address.address,
					delivery_name: 	orderer_address.name,
					payment: 		params[:order][:payment]
					)
				order.total_fee = calc_TotalFee(orderer.cart_items)
				order.postage = 800
				if order.save

INSERT INTO "addresses" ("end_user_id", "postal_code", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["end_user_id", 3], ["postal_code", "@@@a"], ["address", "@@@"], ["name", "@@@"], ["created_at", "2020-09-26 19:06:48.047277"], ["updated_at", "2020-09-26 19:06:48.047277"]]
INSERT INTO "orders" ("end_user_id", "postcode", "address", "delivery_name", "postage", "total_fee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
				order = Order.new(order_params)
				order.total_fee = calc_TotalFee(orderer.cart_items)
				order.postage = 800
				if address.save and order.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["end_user_id", 1], ["item_id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 8]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "order_details" ("item_id", "order_id", "price_include_tax", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 1], ["price_include_tax", 110], ["amount", 1], ["created_at", "2020-09-15 02:52:03.872503"], ["updated_at", "2020-09-15 02:52:03.872503"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
	def confirm
		item_ids = params[:order_detail][:item_ids_list].split(' ').map{|str| str.to_i}
		item_ids.each do |item_id|
			cart_item = CartItem.find_by(
				end_user_id: current_end_user.id,
				item_id:	 item_id
			)
			item = Item.find(item_id)
			order_detail = OrderDetail.new(
				order_id: params[:order_detail][:order_id],
				item_id:  item_id,
				price_include_tax: (item.price*1.1).to_i,
				amount:   cart_item.amount
			)
			if order_detail.save
				cart_item.destroy

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 10]]
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."end_user_id" = ? LIMIT ?  [["end_user_id", 10], ["LIMIT", 1]]
---
	def cart_item_exist?
		if current_end_user.cart_items.empty?

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."end_user_id" = ?  [["end_user_id", 10]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def calc_TotalFee(cart_items)
		sum = 0
		cart_items.each do |cart_item|
			sum += Item.find(cart_item.item_id).price*cart_item.amount