app/controllers/end_users/order_details_controller.rb

    def index
        orders = current_end_user.orders
        @order_details_2d = []
        orders.each do |order|
            @order_details_2d.push(order.order_details)
---
SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."end_user_id" = ?  [["end_user_id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 5]]