app/controllers/end_users_controller.rb

    def switch
        #is_deletedカラムにフラグを立てる(defaultはfalse)
        current_end_user.update(is_active: false)
---
UPDATE "end_users" SET "is_active" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["is_active", 0], ["updated_at", "2020-08-03 08:34:56.770362"], ["id", 1]]